app/controllers/notes_controller.rb

def index
	@notes = Note.where(user_id: current_user)
---
SELECT `notes`.* FROM `notes` WHERE `notes`.`user_id` IS NULL

def create
@note = current_user.notes.build(note_params)


if @note.save
---
INSERT INTO `notes` (`title`, `content`, `created_at`, `updated_at`, `user_id`) VALUES ('Cricket', 'india vs NZ', '2016-10-16 13:40:40', '2016-10-16 13:40:40', 1)

def destroy
@note.destroy
---
DELETE FROM `notes` WHERE `notes`.`id` = 5

def find_note
@note = Note.find(params[:id])
---
SELECT  `notes`.* FROM `notes` WHERE `notes`.`id` = 5 LIMIT 1